{
    "char2idx": {
        " ": 142,
        "!": 133,
        "\"": 139,
        "&": 137,
        "'": 140,
        ",": 132,
        "-": 138,
        ".": 131,
        "0": 3,
        "1": 4,
        "2": 5,
        "3": 6,
        "4": 7,
        "5": 8,
        "6": 9,
        "7": 10,
        "8": 11,
        "9": 12,
        ":": 136,
        ";": 135,
        "<eos>": 1,
        "<pad>": 2,
        "<sos>": 0,
        "?": 134,
        "A": 39,
        "B": 40,
        "C": 41,
        "D": 42,
        "E": 43,
        "F": 44,
        "G": 45,
        "H": 46,
        "I": 47,
        "J": 48,
        "K": 49,
        "L": 50,
        "M": 51,
        "N": 52,
        "O": 53,
        "P": 54,
        "Q": 55,
        "R": 56,
        "S": 57,
        "T": 58,
        "U": 59,
        "V": 60,
        "W": 61,
        "X": 62,
        "Y": 63,
        "Z": 64,
        "`": 141,
        "a": 13,
        "b": 14,
        "c": 15,
        "d": 16,
        "e": 17,
        "f": 18,
        "g": 19,
        "h": 20,
        "i": 21,
        "j": 22,
        "k": 23,
        "l": 24,
        "m": 25,
        "n": 26,
        "o": 27,
        "p": 28,
        "q": 29,
        "r": 30,
        "s": 31,
        "t": 32,
        "u": 33,
        "v": 34,
        "w": 35,
        "x": 36,
        "y": 37,
        "z": 38,
        "Ё": 104,
        "А": 98,
        "Б": 99,
        "В": 100,
        "Г": 101,
        "Д": 102,
        "Е": 103,
        "Ж": 105,
        "З": 106,
        "И": 107,
        "Й": 108,
        "К": 109,
        "Л": 110,
        "М": 111,
        "Н": 112,
        "О": 113,
        "П": 114,
        "Р": 115,
        "С": 116,
        "Т": 117,
        "У": 118,
        "Ф": 119,
        "Х": 120,
        "Ц": 121,
        "Ч": 122,
        "Ш": 123,
        "Щ": 124,
        "Ъ": 125,
        "Ы": 126,
        "Ь": 127,
        "Э": 128,
        "Ю": 129,
        "Я": 130,
        "а": 65,
        "ать": 161,
        "б": 66,
        "в": 67,
        "г": 68,
        "д": 69,
        "е": 70,
        "ен": 152,
        "ени": 153,
        "ет": 147,
        "ете": 154,
        "ж": 72,
        "з": 73,
        "и": 74,
        "ит": 148,
        "ить": 157,
        "й": 75,
        "к": 76,
        "л": 77,
        "м": 78,
        "н": 79,
        "но": 149,
        "ны": 150,
        "о": 80,
        "ост": 156,
        "п": 81,
        "по": 143,
        "при": 162,
        "р": 82,
        "с": 83,
        "ст": 146,
        "т": 84,
        "те": 151,
        "то": 145,
        "тор": 158,
        "тся": 160,
        "ть": 144,
        "тьс": 159,
        "у": 85,
        "ф": 86,
        "х": 87,
        "ц": 88,
        "ч": 89,
        "ш": 90,
        "щ": 91,
        "ъ": 92,
        "ы": 93,
        "ь": 94,
        "ься": 155,
        "э": 95,
        "ю": 96,
        "я": 97,
        "ё": 71
    },
    "ngramms": {
        "2": ["ен", "ет", "ит", "но", "ны", "по", "ст", "те", "то", "ть"],
        "3": ["ать", "ени", "ете", "ить", "ост", "при", "тор", "тся", "тьс", "ься"]
    },
    "max_ngramm": 3
}